
%% 假设检验
%%  方差已知时正态总体均值的假设检验
%%  如果已知方差和均值

clear all;
X=[490 513 514 513 511 499 515 512 491];
[H1,P1,CI1,STATS1]=ztest(X,500,10,0.05,0)   %显著性水平ALPHA=0.05   期望是500  方差是10
[H2,P2,CI2,STATS2]=ztest(X,500,10,0.1,0)    %ALPHA=0.1       H2=1  拒绝原来假设
%%  方差和均值未知时   

clear all;
X=[300 324 305 290 295 291 310 315];
[H,P,CI,STATS]=ttest(X,305,0.05,-1)   %ALPHA=0.05    H=0可以接受原假设
%%  方差未知但是相等时
clear all;
X=[302 304 305 310 320 299 298 301 315 313];
Y=[305 314 320 315 313 308 318 325 301 312];
[H,P,CI,STATS]=ttest2(X,Y,0.05,-1)            %ALPHA=0.05
%%  分布一致性检验
clear all;
X=[3.2 7.0 2.8 4.5 7.5 2.3 5.8 1.4];
Y=[2.3 5.6 9.2 1.2 5.9 3.4 2.8 8.4 1.5 3.2];
[P,H,STATS]=ranksum(X,Y,0.05)                   %ALPHA=0.05
%%  
%%   大仙QQ：1960009019
%%   在线教育微信公众号：大仙一品堂
%%   大鱼号：在线教育大仙一品堂
%%   一点资讯号：大仙一品堂